const quiz = [
  {
    question: "01. పార్వతీదేవి భర్త ఎవరు?",
    options: ["విష్ణువు", "బ్రహ్మ", "శివుడు", "ఇంద్రుడు"],
    correct: 2
  },
  {
    question: "02. పార్వతీదేవి ఎవరికి కుమార్తె?",
    options: ["హిమవంతుడు-మేనక", "కేసరి-అంజనా దేవి", "దశరథ మహారాజు-కౌసల్యా దేవి", "మహావిష్ణువు-లక్ష్మీదేవి"],
    correct: 0
  },
  {
    question: "03. దుర్గాదేవి వాహనం ఏమిటి?",
    options: ["ఒంటె", "నెమలి", "సింహం", "పాము"],
    correct: 2
  },
  {
    question: "04. దసరా (విజయదశమి) రోజు దుర్గాదేవి ఏ రాక్షసుడిని సంహరించింది?",
    options: ["భస్మాసురుడు", "మహిషాసురుడు", "రావణుడు", "హిరణ్యకశిపుడు"],
    correct: 1
  },
  {
    question: "05. అమ్మవారి నవదుర్గ రూపాలలో మొదటి రూపం ఏది?",
    options: ["శైలపుత్రీ", "బ్రహ్మచారిణీ", "చంద్రఘంటా", "కూష్మాండ"],
    correct: 0
  },
  {
    question: "06. అమ్మవారు నివసించే ప్రదేశంగా ఏమి చెప్పబడుతుంది?",
    options: ["కైలాసం", "వైకుంఠం", "మణిద్వీపం", "భైరవద్వీపం"],
    correct: 2
  },
  {
    question: "07. అమ్మవారికి ఇష్టమైన ‘శ్రీ దేవీ సూక్తం’ ఏ వేదంలో చెప్పబడింది?",
    options: ["ఋగ్వేదము", "యజుర్వేదం", "సామవేదం", "అథర్వవేదం"],
    correct: 0
  },
  {
    question: "08. ‘లలితా సహస్రనామం’ ఎవరు ఎవరికి ఉపదేశించారు?",
    options: ["బ్రహ్మ దేవుడు-నారద మహర్షి", "శుక మహర్షి-పరీక్షిత్తు మహారాజుకు", "హయగ్రీవ స్వామి-అగస్త్య మహర్షి", "శ్రీమహావిష్ణువు-నారద మహర్షి"],
    correct: 2
  },
  {
    question: "09. ‘విజయదశమి రోజు’ ఏ చెట్టును భక్తితో పూజించి ప్రదక్షిణలు చేయాలి?",
    options: ["జమ్మి చెట్టు (శమీ వృక్షం)", "మామిడి చెట్టు", "రావి చెట్టు (అశ్వత్థ వృక్షం)", "మేడి చెట్టు"],
    correct: 0
  },
  {
    question: "10. దుర్గాదేవి యొక్క జన్మ నక్షత్రం ఏమిటి?",
    options: ["ఆశ్లేష", "హస్త", "మూల", "రోహిణి"],
    correct: 2
  },
  {
    question: "11. సతీదేవి శరీర భాగాలు పడిన పవిత్ర స్థలాలు ఏమని పిలవబడతాయి?",
    options: ["నవ తిరుపతులు", "శక్తిపీఠాలు", "జ్యోతిర్లింగాలు", "పంచారామాలు"],
    correct: 1
  },
  {
    question: "12. అమ్మవారి శక్తిపీఠాలలో ప్రధానమైనది (ఆది శక్తిపీఠం) ఏది?",
    options: ["కామాఖ్య", "శ్రీశైలం", "కాంచీపురం", "పిఠాపురం"],
    correct: 0
  },
  {
    question: "13. జ్యోతిర్లింగం, శక్తిపీఠం ఒకే ప్రాంగణంలో ఉన్న ఏకైక క్షేత్రం ఏది?",
    options: ["కామాఖ్య", "శ్రీశైలం", "కాంచీపురం", "పిఠాపురం"],
    correct: 1
  },
  {
    question: "14. శ్రీ లలితా సహస్రనామ స్తోత్రంలో 58వ నామం ‘పంచబ్రహ్మాసనస్థితా’ అర్థం ఏమిటి?",
    options: ["బ్రహ్మ, విష్ణు, రుద్ర, ఈశ్వర, సదాశివలు పీఠంగా కూర్చొన్న అమ్మవారు", "ఐదు హస్తాలు కలిగిన అమ్మవారు", "పంచభూతాలను సూచించే అమ్మవారు", "పంచముఖాలతో దర్శనమిచ్చే అమ్మవారు"],
    correct: 0
  },
  {
    question: "15. శ్రీ లలితా త్రిపురసుందరి దేవికి ప్రధాన మంత్రిణి ఎవరు?",
    options: ["మహాలక్ష్మి", "మహా సరస్వతి", "రాజ శ్యామల (మాతంగి)", "వారాహీ దేవి"],
    correct: 2
  },
  {
    question: "16. శ్రీ లలితా త్రిపురసుందరి దేవికి సైన్యాధ్యక్షురాలు ఎవరు?",
    options: ["మహాలక్ష్మి", "మహా సరస్వతి", "రాజ శ్యామల (మాతంగి)", "వారాహీ దేవి"],
    correct: 3
  },
  {
    question: "17. శ్రీ లలితా త్రిపురసుందరి దేవి యొక్క నాలుగు ప్రధాన ఆయుధాలలో లేనిది ఏది?",
    options: ["పాశం (రాగం)", "అంకుశం (క్రోధం)", "చెరకు విల్లు (మనస్సు)", "చక్రం (ధర్మ సంస్థాపన)"],
    correct: 3
  },
  {
    question: "18. దశమహావిద్యలలో ఒకరైన ‘శ్రీ ఛిన్న మస్తా దేవి’ ఆలయం ఆంధ్రప్రదేశ్ లో ఎక్కడ వున్నది?",
    options: ["పిఠాపురం", "ద్రాక్షారామం", "వేటమామిడి", "కోటప్పకొండ"],
    correct: 2
  },
  {
    question: "19. శ్రీ లలితా త్రిపురసుందరి దేవిని కీర్తించే ‘సౌందర్యలహరి’ని ఎవరు రచించారు?",
    options: ["మహాకవి కాళిదాసు", "ఆది శంకరాచార్యులు", "వేదవ్యాసుడు", "కుమారిల భట్టు"],
    correct: 1
  },
  {
    question: "20. ‘దేవీ భాగవతం’ ఏ సంప్రదాయానికి చెందినది?",
    options: ["వైష్ణవం", "శైవం", "శాక్తేయం", "గాణాపత్యం"],
    correct: 2
  },
  {
    question: "21. దుర్వాస మహర్షి రచించిన ‘ఆర్యా ద్విశతి’ లో ఎవరి గురించి ముఖ్యంగా వర్ణిస్తారు?",
    options: ["సరస్వతీ దేవి", "దుర్గా దేవి", "లలితా దేవి", "భద్రకాళి"],
    correct: 2
  }
];
